librbd_iscsi/yujiang/randwrite/logs/fio-1m.fio.log
randwrite-1m: (g=0): rw=randwrite, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randwrite-1m;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;117411840;195643;191;600131;92;3297;322.003960;63.702759;7469;1552212;83417.600508;81442.749803;1.000000%=19529;5.000000%=28180;10.000000%=33816;20.000000%=41156;30.000000%=47448;40.000000%=53739;50.000000%=60555;60.000000%=68681;70.000000%=81264;80.000000%=102236;90.000000%=149946;95.000000%=214958;99.000000%=438304;99.500000%=541065;99.900000%=926941;99.950000%=1027604;99.990000%=1400897;0%=0;0%=0;0%=0;7644;1552553;83739.604468;81443.140802;2048;327680;100.000000%;196815.396147;70272.097171;36.604902%;63.325113%;79479;0;276443;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.02%;1.10%;32.88%;45.33%;17.01%;3.00%;0.47%;0.13%;0.06%;0.00%;sda;0;23100;0;11616;0;251444;251424;1.12%

randwrite-1m: (groupid=0, jobs=1): err= 0: pid=4050294: Thu May 21 15:58:34 2020
  write: IOPS=191, BW=191MiB/s (200MB/s)(112GiB/600131msec)
    slat (usec): min=92, max=3297, avg=322.00, stdev=63.70
    clat (msec): min=7, max=1552, avg=83.42, stdev=81.44
     lat (msec): min=7, max=1552, avg=83.74, stdev=81.44
    clat percentiles (msec):
     |  1.00th=[   20],  5.00th=[   29], 10.00th=[   34], 20.00th=[   42],
     | 30.00th=[   48], 40.00th=[   54], 50.00th=[   61], 60.00th=[   69],
     | 70.00th=[   82], 80.00th=[  103], 90.00th=[  150], 95.00th=[  215],
     | 99.00th=[  439], 99.50th=[  542], 99.90th=[  927], 99.95th=[ 1028],
     | 99.99th=[ 1401]
   bw (  KiB/s): min= 2048, max=327680, per=100.00%, avg=196815.40, stdev=70272.10, samples=1194
   iops        : min=    2, max=  320, avg=192.13, stdev=68.64, samples=1194
  lat (msec)   : 10=0.02%, 20=1.10%, 50=32.88%, 100=45.33%, 250=17.01%
  lat (msec)   : 500=3.00%, 750=0.47%, 1000=0.13%, 2000=0.06%
  cpu          : usr=36.60%, sys=63.33%, ctx=79479, majf=0, minf=276443
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,114660,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=191MiB/s (200MB/s), 191MiB/s-191MiB/s (200MB/s-200MB/s), io=112GiB (120GB), run=600131-600131msec

Disk stats (read/write):
  sda: ios=0/23100, merge=0/11616, ticks=0/251444, in_queue=251424, util=1.12%