librbd_iscsi/yujiang/randwrite/logs/fio-256k.fio.log
randwrite-256k: (g=0): rw=randwrite, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randwrite-256k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;62456064;104088;406;600028;21;396;67.198064;22.983033;3622;1771607;39281.670445;44768.132936;1.000000%=6520;5.000000%=11468;10.000000%=14614;20.000000%=19267;30.000000%=22937;40.000000%=26607;50.000000%=30539;60.000000%=34865;70.000000%=41156;80.000000%=49020;90.000000%=64749;95.000000%=85458;99.000000%=196083;99.500000%=304087;99.900000%=591396;99.950000%=641728;99.990000%=1182793;0%=0;0%=0;0%=0;3708;1771664;39348.868509;44768.566383;2560;153600;100.000000%;104517.554348;30392.613269;34.448616%;65.392891%;193021;0;81097;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.01%;3.46%;18.66%;58.84%;15.62%;2.75%;0.43%;0.20%;0.01%;0.01%;0.00%;sda;0;23420;0;11681;0;179936;179932;0.99%

randwrite-256k: (groupid=0, jobs=1): err= 0: pid=4042280: Thu May 21 15:48:33 2020
  write: IOPS=406, BW=102MiB/s (107MB/s)(59.6GiB/600028msec)
    slat (usec): min=21, max=396, avg=67.20, stdev=22.98
    clat (msec): min=3, max=1771, avg=39.28, stdev=44.77
     lat (msec): min=3, max=1771, avg=39.35, stdev=44.77
    clat percentiles (msec):
     |  1.00th=[    7],  5.00th=[   12], 10.00th=[   15], 20.00th=[   20],
     | 30.00th=[   23], 40.00th=[   27], 50.00th=[   31], 60.00th=[   35],
     | 70.00th=[   42], 80.00th=[   50], 90.00th=[   65], 95.00th=[   86],
     | 99.00th=[  197], 99.50th=[  305], 99.90th=[  592], 99.95th=[  642],
     | 99.99th=[ 1183]
   bw (  KiB/s): min= 2560, max=153600, per=100.00%, avg=104517.55, stdev=30392.61, samples=1196
   iops        : min=   10, max=  600, avg=408.20, stdev=118.71, samples=1196
  lat (msec)   : 4=0.01%, 10=3.46%, 20=18.66%, 50=58.84%, 100=15.62%
  lat (msec)   : 250=2.75%, 500=0.43%, 750=0.20%, 1000=0.01%, 2000=0.01%
  cpu          : usr=34.45%, sys=65.39%, ctx=193021, majf=0, minf=81097
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,243969,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=102MiB/s (107MB/s), 102MiB/s-102MiB/s (107MB/s-107MB/s), io=59.6GiB (63.0GB), run=600028-600028msec

Disk stats (read/write):
  sda: ios=0/23420, merge=0/11681, ticks=0/179936, in_queue=179932, util=0.99%