librbd_iscsi/yujiang/randwrite/logs/fio-4m.fio.log
randwrite-4m: (g=0): rw=randwrite, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randwrite-4m;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;255827968;426211;104;600237;462;10528;1446.247604;593.213121;29775;1650262;152301.403482;92565.755137;1.000000%=52166;5.000000%=67633;10.000000%=77070;20.000000%=91750;30.000000%=104333;40.000000%=116916;50.000000%=129499;60.000000%=145752;70.000000%=164626;80.000000%=193986;90.000000%=246415;95.000000%=308281;99.000000%=497025;99.500000%=608174;99.900000%=1019215;99.950000%=1182793;99.990000%=1451229;0%=0;0%=0;0%=0;30927;1651649;153747.651086;92570.116665;24576;617319;100.000000%;427102.038365;80468.669200;40.515830%;59.235269%;42690;0;5599586;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.68%;25.86%;63.89%;8.59%;0.69%;0.18%;0.11%;0.00%;sda;104;23583;0;11857;8;252984;252988;1.10%

randwrite-4m: (groupid=0, jobs=1): err= 0: pid=4060591: Thu May 21 16:08:35 2020
  write: IOPS=104, BW=416MiB/s (436MB/s)(244GiB/600237msec)
    slat (usec): min=462, max=10528, avg=1446.25, stdev=593.21
    clat (msec): min=29, max=1650, avg=152.30, stdev=92.57
     lat (msec): min=30, max=1651, avg=153.75, stdev=92.57
    clat percentiles (msec):
     |  1.00th=[   53],  5.00th=[   68], 10.00th=[   78], 20.00th=[   92],
     | 30.00th=[  105], 40.00th=[  117], 50.00th=[  130], 60.00th=[  146],
     | 70.00th=[  165], 80.00th=[  194], 90.00th=[  247], 95.00th=[  309],
     | 99.00th=[  498], 99.50th=[  609], 99.90th=[ 1020], 99.95th=[ 1183],
     | 99.99th=[ 1452]
   bw (  KiB/s): min=24576, max=617319, per=100.00%, avg=427102.04, stdev=80468.67, samples=1199
   iops        : min=    6, max=  150, avg=104.21, stdev=19.65, samples=1199
  lat (msec)   : 50=0.68%, 100=25.86%, 250=63.89%, 500=8.59%, 750=0.69%
  lat (msec)   : 1000=0.18%, 2000=0.11%
  cpu          : usr=40.52%, sys=59.24%, ctx=42690, majf=0, minf=5599586
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,62458,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=416MiB/s (436MB/s), 416MiB/s-416MiB/s (436MB/s-436MB/s), io=244GiB (262GB), run=600237-600237msec

Disk stats (read/write):
  sda: ios=104/23583, merge=0/11857, ticks=8/252984, in_queue=252988, util=1.10%