librbd_iscsi/yujiang/randwrite/logs/fio-64k.fio.log
randwrite-64k: (g=0): rw=randwrite, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randwrite-64k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;19744256;32904;514;600047;6;626;20.596950;8.749399;2624;1340004;31097.694803;37082.854045;1.000000%=3981;5.000000%=7766;10.000000%=10420;20.000000%=13959;30.000000%=16908;40.000000%=20054;50.000000%=23199;60.000000%=26869;70.000000%=31850;80.000000%=39059;90.000000%=53215;95.000000%=72876;99.000000%=177209;99.500000%=252706;99.900000%=497025;99.950000%=557842;99.990000%=775946;0%=0;0%=0;0%=0;2635;1340025;31118.291754;37083.143102;128;49664;100.000000%;32967.790659;10577.619156;32.953974%;66.843209%;263375;0;34654;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;1.00%;7.98%;31.10%;48.23%;9.12%;2.06%;0.42%;0.09%;0.01%;0.01%;0.00%;sda;0;20431;0;11246;0;130752;130752;1.03%

randwrite-64k: (groupid=0, jobs=1): err= 0: pid=4033917: Thu May 21 15:38:32 2020
  write: IOPS=514, BW=32.1MiB/s (33.7MB/s)(18.8GiB/600047msec)
    slat (usec): min=6, max=626, avg=20.60, stdev= 8.75
    clat (msec): min=2, max=1340, avg=31.10, stdev=37.08
     lat (msec): min=2, max=1340, avg=31.12, stdev=37.08
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[    8], 10.00th=[   11], 20.00th=[   14],
     | 30.00th=[   17], 40.00th=[   21], 50.00th=[   24], 60.00th=[   27],
     | 70.00th=[   32], 80.00th=[   40], 90.00th=[   54], 95.00th=[   73],
     | 99.00th=[  178], 99.50th=[  253], 99.90th=[  498], 99.95th=[  558],
     | 99.99th=[  776]
   bw (  KiB/s): min=  128, max=49664, per=100.00%, avg=32967.79, stdev=10577.62, samples=1199
   iops        : min=    2, max=  776, avg=515.06, stdev=165.27, samples=1199
  lat (msec)   : 4=1.00%, 10=7.98%, 20=31.10%, 50=48.23%, 100=9.12%
  lat (msec)   : 250=2.06%, 500=0.42%, 750=0.09%, 1000=0.01%, 2000=0.01%
  cpu          : usr=32.95%, sys=66.84%, ctx=263375, majf=0, minf=34654
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,308504,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=32.1MiB/s (33.7MB/s), 32.1MiB/s-32.1MiB/s (33.7MB/s-33.7MB/s), io=18.8GiB (20.2GB), run=600047-600047msec

Disk stats (read/write):
  sda: ios=0/20431, merge=0/11246, ticks=0/130752, in_queue=130752, util=1.03%