librbd_iscsi/yujiang/randwrite/logs/fio-8k.fio.log
randwrite-8k: (g=0): rw=randwrite, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=rbd, iodepth=16
fio-3.1
Starting 1 process
3;fio-3.1;randwrite-8k;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;3576744;5961;745;600012;1;708;7.553984;4.751993;2068;734149;21462.603911;33075.812183;1.000000%=2867;5.000000%=3686;10.000000%=4947;20.000000%=8159;30.000000%=10944;40.000000%=13303;50.000000%=16187;60.000000%=19005;70.000000%=22413;80.000000%=27131;90.000000%=35389;95.000000%=46399;99.000000%=125304;99.500000%=219152;99.900000%=513802;99.950000%=541065;99.990000%=608174;0%=0;0%=0;0%=0;2072;734161;21470.157895;33075.984215;32;12864;100.000000%;5966.136667;2888.967210;33.040394%;66.688111%;371877;0;134938;0.1%;0.1%;0.1%;0.1%;100.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;6.33%;20.16%;36.87%;32.46%;2.86%;0.90%;0.29%;0.13%;0.00%;0.00%;0.00%;sda;0;23140;0;11795;0;144536;144536;1.15%

randwrite-8k: (groupid=0, jobs=1): err= 0: pid=4024949: Thu May 21 15:28:32 2020
  write: IOPS=745, BW=5961KiB/s (6104kB/s)(3493MiB/600012msec)
    slat (nsec): min=1595, max=708459, avg=7553.98, stdev=4751.99
    clat (msec): min=2, max=734, avg=21.46, stdev=33.08
     lat (msec): min=2, max=734, avg=21.47, stdev=33.08
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[    4], 10.00th=[    5], 20.00th=[    9],
     | 30.00th=[   11], 40.00th=[   14], 50.00th=[   17], 60.00th=[   20],
     | 70.00th=[   23], 80.00th=[   28], 90.00th=[   36], 95.00th=[   47],
     | 99.00th=[  126], 99.50th=[  220], 99.90th=[  514], 99.95th=[  542],
     | 99.99th=[  609]
   bw (  KiB/s): min=   32, max=12864, per=100.00%, avg=5966.14, stdev=2888.97, samples=1200
   iops        : min=    4, max= 1608, avg=745.71, stdev=361.12, samples=1200
  lat (msec)   : 4=6.33%, 10=20.16%, 20=36.87%, 50=32.46%, 100=2.86%
  lat (msec)   : 250=0.90%, 500=0.29%, 750=0.13%
  cpu          : usr=33.04%, sys=66.69%, ctx=371877, majf=0, minf=134938
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,447093,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=5961KiB/s (6104kB/s), 5961KiB/s-5961KiB/s (6104kB/s-6104kB/s), io=3493MiB (3663MB), run=600012-600012msec

Disk stats (read/write):
  sda: ios=0/23140, merge=0/11795, ticks=0/144536, in_queue=144536, util=1.15%